IRP/src/InformationRegisters/T9510S_Staffing/T9510S_Staffing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9510S_Staffing</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Fired</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <resources>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </resources>
 <resources>
  <name>EmployeeSchedule</name>
  <type>
   <types>CatalogRef.EmployeeSchedule</types>
  </type>
 </resources>
 <resources>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9510S_Staffing/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Record, ThisObject);
	EndIf;
	
	If Parameters.FillingValues.Property("Employee") 
		And ValueIsFilled(Parameters.FillingValues.Employee) Then
		ThisObject.Items.Employee.ReadOnly = True;
	EndIf; 
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	SetVisibilityAvailability(Record, ThisObject);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	SetVisibilityAvailability(Record, ThisObject);
EndProcedure

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Record, Form)
	Form.Items.Company.Visible  = Not Record.Fired;
	Form.Items.Branch.Visible   = Not Record.Fired;
	Form.Items.Position.Visible = Not Record.Fired;
EndProcedure

&AtClient
Procedure FiredOnChange(Item)
	If Record.Fired Then
		Record.Company  = Undefined;
		Record.Branch   = Undefined;
		Record.Position = Undefined;
	EndIf;
	SetVisibilityAvailability(Record, ThisObject);
EndProcedure
